export const FATE_CONFIG = {
    predefined: {
        "паляниця": 2, "бавовна": 2, "україна": 2, "зсу": 2, "азов": 2,
        "крим": 2, "буданов": 2, "залужний": 2, "маріуполь": 2, "діти": 2,
        "борщ": 0, "кавун": 0, "волонтери": 0, "дія": 0, "монобанк": 0,
        "сало": 0, "київ": 0, "львів": 0, "харків": 0, "одеса": 0, "сирники": 0,
        "джавелін": 0, "хаймерс": 0, "атб": 0, "кіт": 0, "пес патрон": 0,
        "minecanton209": 0,
        "тривога": 1, "черга": 1, "корупція": 1, "графік": 1, "ціни": 1,
        "курс": 1, "понеділок": 1, "сесія": 1, "мтс": 1, "затори": 1,
        "сусіди": 1, "тариф": 1, "холод": 1, "дощ": 1,
        "русня": 3, "путін": 3, "москва": 3, "шахед": 3, "тцк": 3,
        "кацап": 3, "блекаут": 3, "ракета": 3, "обстріл": 3, "кремль": 3
    } as Record<string, number>,

    variants: {
        0: { title: 'ПЕРЕМОГА', color: 'bg-blue-600', text: 'text-blue-100', icon: '😎', confetti: false },
        1: { title: 'ЗРАДА', color: 'bg-orange-600', text: 'text-orange-100', icon: '😒', confetti: false },
        2: {
            title: 'ТОТАЛЬНА ПЕРЕМОГА',
            color: 'bg-gradient-to-br from-yellow-300 via-amber-500 to-yellow-600',
            text: 'text-black',
            icon: '👑',
            confetti: true
        },
        3: { title: 'ТОТАЛЬНА ЗРАДА', color: 'bg-zinc-950', text: 'text-red-500', icon: '💀', confetti: false },
    } as Record<number, any>
};